//
//  Answer.swift
//  Questionnaire
//
//  Created by Рамил Гаджиев on 23.08.2021.
//

import Foundation


struct Answer {
    let text: String
    let type: AnimalType
}

enum AnimalType: String {
    case dog = "🐶"
    case cat = "🐱"
    case rabbit = "🐰"
    case turtle = "🐢"
    case unknown = "👀"
    
    var definition: String {
        switch self {
        case .dog:
            return "Вам нравится быть с друзьями. Вы окружаете себя людьми, которые Вам нравятся и всегда готовы помочь."
        case .cat:
            return "Вы себе на уме. Любите гулять сами по себе. Вы цените одиночество."
        case .rabbit:
            return "Вам нравится все мягкое. Вы здоровы и полны энергии."
        case .turtle:
            return "Ваша сила в мудрости. Медленный и вдумчивый выигрывает на больших дистанциях."
        case .unknown:
            return "Что-то пошло не так."
        }
    }
}
